Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/environment/waste_management_and_recycling/recycling_waste_from_electrical_and_electronic_equipment.html.txt.tmx
Source language: en
Languages: ga

source: Recycling Waste Electrical and Electronic Equipment
ga: Dramh-threalamh Leictreonach agus Leictreach a Athchúrsáil

source: In 2005 the EU introduced new legislation to deal with Waste from Electrical and Electronic Equipment (WEEE)
ga: Thug an tAE isteach reachtaíocht nua i 2005 chun déileáil le Dramhaíl ó Threalamh Leictreonach agus Leictreach (WEEE)

source: The purpose of this legislation is to ensure that old electrical and electronic equipment is recycled or reused rather than disposed in landfill sites (dumps)
ga: Is í an aidhm atá leis an reachtaíocht sin ná chun a chinntiú go ndéantar athchúrsáil ar shean-trealamh leictreonach agus leictreach nó go n-athúsáidtear é seachas é a chaitheamh i suímh líonta talún (láithreacha dramhaíola)

source: Another aim of the legislation is to encourage better design of electrical and electronic products to ensure that they can be recycled easily and more efficiently
ga: Aidhm eile atá ag an reachtaíocht ná dearadh níos fearr ar tháirgí leictreonacha agus leictreacha a spreagadh lena chinntiú go mbeifear in ann iad a athchúrsáil go héasca agus ar bhonn níos éifeachtúla

source: The WEEE directive was transposed into Irish Law in SI 340 Waste Management (Waste Electrical and Electronic Equipment) Regulations 2005
ga: Trasuíodh an treoir DTLL isteach i nDlí na hÉireann sna Rialacháin um Bainistiú Dramhaíola (Dramhthrealamh Leictreach agus Leictreonach), 2005 (I.R. 340)

source: In December 2008, the European Commission proposed to revise the Directive in order to tackle the fast increasing waste stream
ga: I Nollaig 2008, bheartaigh an Coimisiún Eorpach chun athbhreithniú a dhéanamh ar an Treoir chun dul i ngleic leis an sreabhadh dramhaíola a bhí ag dul i méid go tapa

source: The new WEEE Directive 2012/19/EU entered into force on 13 August 2012 and became effective on 14 February 2014
ga: Tháinig Treoir 2012/19/AE nua an DTLL i bhfeidhm an 13 Lúnasa 2012 agus bhí éifeacht aici an 14 Feabhra 2014

source: Retailers of electrical and electronic equipment have a number of obligations in relation to waste from electrical and electronic equipment
ga: Is ea atá roinnt oibleagáidí ar mhiondíoltóirí trealamh leictreonach agus leictreach maidir leis an dramhaíl a thagann ó threalamh leictreonach agus leictreach

source: • Register as a producer of WEEE
ga: • Clárú mar tháirgeoir DTLL

source: • Provide free in-store take back for customers buying new electrical equipment
ga: • Áit shaor in aisce a sholáthar sa stór do chustaiméirí chun trealamh a thabhairt ar ais nuair a cheannaíonn siad trealamh nua leictreach

source: • Ensure that waste electrical products are stored and transported to an approved collection facility appropriately
ga: • A chinntiú go stóráiltear dramhaíl táirgí leictreacha agus go n-aistrítear í chuig saoráid bailiúcháin cheadaithe mar is cuí

source: • Ensure that consumers of electrical equipment are aware of take-back options available to them
ga: • A chinntiú go mbíonn tomhaltóirí a cheannaíonn trealamh leictreach ar an eolas faoi na roghanna atá ar fáil dóibh táirgí a thabhairt ar ais

source: There is more detail on these obligations below
ga: Tá níos mó sonraí faoi na hoibleagáidí sin thíos

source: Retailers must provide free in-store take back for old electrical and electronic equipment from customers
ga: Ní mór do mhiondíoltóirí seirbhís a sholáthar ina nglactar seantrealamh leictreach agus leictreonach ar ais saor in aisce ó chustaiméirí

source: This must be done on a one-for-one, like-for-like basis
ga: Ní mór seo a dhéanamh ar bhonn aon d’aon, earra d’earra comhchosúil

source: This means that the old product must be of the same type or have fulfilled the same function as the new item purchased
ga: Ciallaíonn seo nach mór go bhfuil an seantáirge den saghas céanna nó gur chomhlíon sé an fheidhm chéanna leis an earra nua a ceannaíodh

source: However, retailers with an electrical sales area greater than 400 square meters will have to accept small appliances (less than 25 cm) from customers for recycling without the customer having to make a purchase
ga: Beidh ar mhiondíoltóirí a bhfuil limistéar díolachán leictreach acu atá os cionn 400 méadar cearnach glacadh le fearais bheaga (níos lú ná 25 cm) ó chustaiméirí lena n-athchúrsáil gan a bheith ar an gcustaiméir earra éigin a cheannach

source: If a product is being delivered you are entitled to have the old item collected at the same time for no extra cost on the same one-for-one, like for like basis
ga: Má dhéantar táirge a sheachadadh chugat, tá tú i dteideal go mbaileofar an seanearra ag an tráth céanna ar chostas ar bith sa bhreis ar an mbonn céanna aon d’aon, earra d’earra comhchosúil

source: If a new product is being delivered to a customer’s home retailers cannot charge for collection of the waste equipment (although a retailer can charge a delivery fee)
ga: Má tá táirge nua á sheachadadh chuig teach custaiméara, ní féidir le miondíoltóirí táille a ghearradh ar bhailiú an dramhthrealaimh (ach is féidir le miondíoltóir táille sheachadta a ghearradh)

source: Retailers must give 24 hours notice of delivery and the old item must be disconnected from all utilities
ga: Ní mór do mhiondíoltóirí fógra 24 uair an chloig a thabhairt sula ndéanfar an seachadadh agus ní mór an seanearra a dhínascadh ó gach fóntais

source: If a retailer has not given 24 hours’ notice of delivery and an old appliance is not ready for collection they must return to collect it within 15 days
ga: Murar thug miondíoltóir fógra 24 uair i leith seachadta agus mura bhfuil seanfhearas réidh lena bhailiú, ní mór dóibh filleadh chun é a bhailiú laistigh de 15 lá

source: If you do not wish to avail of the free collection of waste equipment on delivery of new equipment, then you can return it to the retailer’s premises at any time
ga: Mura mian leat fáil a bheith agat ar dhramhthrealamh a bheith bailithe duit saor in aisce nuair a sheachadtar trealamh nua, is féidir leat an dramhthrealamh a thabhairt chuig áitreabh an mhiondíoltóra ag tráth ar bith

source: You can deposit certain types of waste batteries at retail outlets for free (see 'Batteries and contaminated waste' below)
ga: Féadfaidh tú saghsanna áirithe de dhramhchadhnraí a fhágáil i mboscaí sannta in asraonta miondíola saor in aisce (féach ‘Cadhnraí agus dramhaíl éilithe’ thíos)

source: Producers have to fund the recycling of WEEE arising from goods they place on the market after 13 August 2005, and also the recycling of all WEEE arising from all goods placed on the market prior to this
ga: Caithfidh táirgeoirí athchúrsáil WEEE a mhaoiniú a thagann ó earraí a chuireann siad ar an margadh i ndiaidh 13 Lúnasa 2005, agus freisin an athchúrsáil a dhéantar ar gach WEEE a thagann ó earraí a cuireadh ar an margadh roimhe sin

source: Producers must fund the management of this ‘historic waste’ on the basis of their current market share
ga: Caithfidh táirgeoirí bainistíocht na ‘dramhaíola stairiúla’ sin a mhaoiniú ar bhunús a scair reatha ar an margadh

source: Visible Environmental Management Costs (vEMCs) show the costs of recycling as approved by the WEEE Register Society Limited, an industry-based national WEEE registration body, which has an independent Committee of Management
ga: Léiríonn Costais Bhainistíochta Comhshaoil Infheicthe (vEMCs) na costais athchúrsála arna gceadú ag Cumann Cláraithe WEEE Teoranta, comhlacht cláraithe WEEE náisiúnta tionscal-bhunaithe, a bhfuil Coiste Bainistíochta neamhspleách aige

source: These costs will fund the two collective compliance schemes operating in Ireland, WEEE Ireland and the European Recycling Platform, to enable them to pay for the environmentally sound management of all household WEEE taken back by retailers or deposited by members of the public at local authority civic amenity sites
ga: Maoineoidh na costais sin an dá chomhscéim chomhlíonta atá i bhfeidhm in Éirinn, WEEE Éireann agus Ardán Athchúrsála na hEorpa, chun cur ar a gcumas íoc as bainistíocht mhaith comhshaoil a dhéanamh ar gach WEEE tí a thógann miondíoltóirí ar ais nó a dhiúscraíonn an pobal ag láthair chonláiste pobail de chuid údaráis áitiúil

source: The vEMCs displayed to consumers cannot exceed the actual costs of recycling
ga: Ní féidir leis na vEMCanna a thaispeántar do thomhaltóirí na costais iarbhír a bhaineann le hathchúrsáil a shárú

source: The WEEE Register, the national registration body for producers has verified and issued a schedule of vEMCs (pdf) to be displayed
ga: Tá sceideal vEMCanna (pdf) fíoraithe agus eisithe a bheidh le taispeáint ag an gClár WEEE, an comhlacht clárúcháin náisiúnta do tháirgeoirí

source: Some products attract a visible Environmental Management Cost (vEMC)
ga: Gearrtar Costas infheicthe Bainistíochta Comhshaoil (CiBC) ar roinnt táirgí

source: A vEMC is to be displayed on all refrigeration units, large household appliances, televisions greater than 73cm, gas discharge lamps and LED‘s
ga: Tá CiBC le bheith ar taispeáint ar gach aonad cuisniúcháin, fearas mór teaghlaigh, teilifís os cionn 73cm, lampa gás-díluchtúcháin agus LED

source: The retail price of the item must be shown inclusive of the vEMC and shall include the following wording: ‘Included in this price is a contribution to recycling costs of (amount of contribution)’
ga: Ní mór praghas miondíola an earra a thaispeáint agus an CiBC san áireamh ann agus beidh an fhoclaíocht a leanas le sonrú maidir leis an bpraghas miondíola: ‘San áireamh sa phraghas seo, tá ranníocaíocht le costais athchúrsála (méid na ranníocaíochta)’

source: In all retail transactions each retailer must make available at the point of sale to the purchaser an invoice, receipt or docket which shall state ‘Price of electrical items includes a contribution to recycling costs’
ga: I ngach idirbheart miondíola, ní mór do gach miondíoltóir sonrasc, fáltas nó duillín a chur ar fáil don cheannaitheoir ag pointe an díola ar a luafar ‘Cuirtear ranníocaíocht le costais athchúrsála san áireamh sa phraghas atá ar earraí leictreacha’

source: Information on disposal of equipment
ga: Eolas ar dhiúscairt trealaimh

source: Retailers are obliged to provide information to the consumer on how they can dispose of the electrical and electronic equipment when it comes to the end of that equipment’s life
ga: Tá oibleagáid ar mhiondíoltóirí eolas a sholáthar don tomhaltóir ar conas is féidir leo diúscairt a dhéanamh ar threalamh leictreonach nó leictreach nuair nach mbíonn aon mhaitheas sa trealamh sin níos mó

source: Retailers may do this by providing leaflets or signage at the point of sale
ga: Is féidir le miondíoltóirí é sin a dhéanamh trí bhileoga nó comharthaíocht a chur ar fáil nuair a dhíoltar trealamh

source: Batteries and contaminated waste
ga: Cadhnraí agus dramhaíl éillithe

source: Batteries should be disposed of carefully and not sent to landfill as they are classed as hazardous waste
ga: Ba chóir diúscairt shábháilte a dhéanamh ar chadhnraí agus gan iad a chur chuig líon talún de bhrí go bhfuil siad rangaithe mar dhramhaíl ghuaiseach

source: At present, according to WEEE legislation retailers only need to take batteries, which are contained within electrical or electronic equipment
ga: De réir an WEEE seo ní bheidh ar mhiondíoltóirí a thógáil ar ais ach cadhnraí a bheidh laistigh de threalamh leictreonach nó leictreach

source: You should dispose of all other batteries in a local authority civic amenity site
ga: Ba chóir duit gach cadhnra eile a dhiúscairt i Láthair Chonláiste Pobail

source: You can deposit waste batteries at retail outlets for free
ga: Féadfaidh tú dramhchadhnraí a fhágáil i mboscaí sannta in asraonta miondíola saor in aisce

source: Retailers must take back batteries of a type they supply
ga: Ní mór do mhiondíoltóirí cadhnraí den saghas a sholáthraíonn siad a thógáil ar ais

source: They do not have to take back batteries of a type they do not supply
ga: Níl orthu cadhnraí de shaghas nach soláthraíonn siad a thógáil ar ais

source: For example, retailers will not have to take back a car battery if they only sell batteries suitable for a torch or remote control
ga: Mar shampla, ní bheidh ar mhiondíoltóirí cadhnra gluaisteáin a thógáil ar ais mura ndíolann siad ach cadhnraí atá oiriúnach do thóirse nó do chianrialtóir

source: You do not need to have bought your battery in that particular shop and you do not have to buy anything from the shop when you are depositing waste batteries
ga: Ní gá gur cheannaigh tú do chadhnra sa siopa ar leith sin agus ní gá duit aon rud a cheannach ón siopa nuair a bhíonn dramhchadhnraí á bhfágáil ann agat

source: Retailers are not obliged to accept contaminated waste that would present a health and safety risk to their staff, for example leaking batteries
ga: Níl aon oibleagáid ar mhiondíoltóirí dramhaíl éillithe a ghlacadh a chuirfeadh a bhfoireann i mbaol sláinte agus sábháilteachta

source: You can also deposit waste portable batteries and waste car batteries from privately registered vehicles at local authority civic amenity facilities free of charge
ga: Féadfaidh tú dramhchadhnraí iniompartha agus dramhchadhnraí gluaisteáin ó fheithiclí atá cláraithe go príobháideach a fhágáil ag saoráidí conláiste cathartha údaráis áitiúil saor in aisce

source: Consumers may bring items of electronic and electrical equipment to Civic Amenity sites to dispose of them free of charge
ga: Is féidir le tomhaltóirí ábhair ina bhfuil trealamh leictreonach agus leictreach a thabhairt chuig Láithreacha Conláiste Pobail chun diúscairt a dhéanamh orthu saor in aisce

source: Civic amenity sites are places where all sorts of recyclable material can be delivered and sorted by consumers and are run by local authorities
ga: Chun teacht ar bhreis faisnéise maidir le CBCanna, ba cheart duit teagmháil a dhéanamh leis an gClár DTLL. Tá sonraí teagmhála thíos
